---
title: "Demo: incident map"
date: today
---

In [1]:
import pandas as pd
import requests
import json
import plotly.express as px

# for plotly graphs to show in HTML
import plotly.io as pio
pio.renderers.default = "iframe"
# pio.renderers.default = "plotly_mimetype+notebook_connected"

## Get all Incidents

In [2]:
base_url = 'http://localhost:8000/'
response=requests.get(f'{base_url}incidents').json()
df=pd.DataFrame(response)

df.head()

,incident_rec_id,Collision_Report_Number,incident_date,City_Name,County_Name,Latitude,Longitude
0,1,EC83185,2022-09-07,Bremerton,Kitsap,47.601747,-122.623934
1,2,EC83186,2022-09-10,,Kitsap,47.621335,-122.628863
2,3,EC83467,2022-08-04,,Kitsap,47.854215,-122.584361
3,4,EC83469,2022-09-08,,Kitsap,47.515069,-122.655731
4,5,EC83472,2022-09-13,,Kitsap,47.632233,-122.628873

In [3]:
df.groupby('County_Name').size().reset_index(name='number of incidents')

  County_Name  number of incidents
0        King                29999
1      Kitsap                 2967
2      Pierce                13346
3   Snohomish                11274

- map all incidents

In [4]:
def get_map(df, lat_col, lon_col, color_field):
    fig = px.scatter_map(df, lat=df[lat_col], lon = df[lon_col], zoom=8, color=color_field)
    fig.update_layout(mapbox_style="carto-positron")
    fig.update_layout(margin={"r":0,"t":0,"l":0,"b":0})
    return fig

In [5]:
my_map = get_map(df, 'Latitude', 'Longitude', 'County_Name')
my_map.show()

## Get Incidents by County

In [6]:
payload = {'County_Name': 'King'}
response=requests.get(f'{base_url}/incidents/', payload).json()
df=pd.DataFrame(response)

df.groupby('County_Name').size().reset_index(name='number of incidents')

  County_Name  number of incidents
0        King                29999

In [7]:
my_map = get_map(df, 'Latitude', 'Longitude', 'County_Name')
my_map.show()

## Get Incidents By City

In [8]:
payload = {'City_Name': 'Seattle'}
response=requests.get(f'{base_url}/incidents/', payload).json()
incident_seattle=pd.DataFrame(response)

incident_seattle.groupby('City_Name').size().reset_index(name='number of incidents')

  City_Name  number of incidents
0   Seattle                 8630

In [9]:
my_map = get_map(incident_seattle, 'Latitude', 'Longitude', 'City_Name')
my_map.show()

## Get all Vehicles

In [10]:
response=requests.get(f'{base_url}/vehicles/').json()

df_vehicles=pd.DataFrame(response)
df_vehicles.head()

,vehicle_rec_id,incident_rec_id,unit_number,Vehicle_Type,Collision_Report_Number,Vehicle_Make,Vehicle_Model,Vehicle_Style,VIN
0,1,39036,3,Passenger Car,EC52595,TOYOTA,AVALON,Sedan,4T1BK36B57U193838
1,2,39037,1,"Pickup,Panel Truck or Vanette under 10,000 lb",EC52596,HYUNDAI,TUCSON,UTILITY,KM8JUCAC1AU111178
2,3,39037,2,"Pickup,Panel Truck or Vanette under 10,000 lb",EC52596,NISSAN,ROGUE,UTILITY,JN8AS5MV3CW376358
3,4,39038,1,Passenger Car,EC52597,HONDA,CIVIC,Sedan,2HGES26754H602279
4,5,39039,1,"Pickup,Panel Truck or Vanette under 10,000 lb",EC52598,JEEP,COMPASS,UTILITY,1C4NJDBB7GD637883

### Get Vehicles for Incidents in Seattle

In [11]:
vehicles_list = incident_seattle.Collision_Report_Number.to_list()
payload = {'ids': vehicles_list}

response=requests.get(f'{base_url}/vehicles/', payload).json()

vehicles_seattle=pd.DataFrame(response)
vehicles_seattle.head()

,vehicle_rec_id,incident_rec_id,unit_number,Vehicle_Type,Collision_Report_Number,Vehicle_Make,Vehicle_Model,Vehicle_Style,VIN
0,1,39036,3,Passenger Car,EC52595,TOYOTA,AVALON,Sedan,4T1BK36B57U193838
1,2,39037,1,"Pickup,Panel Truck or Vanette under 10,000 lb",EC52596,HYUNDAI,TUCSON,UTILITY,KM8JUCAC1AU111178
2,3,39037,2,"Pickup,Panel Truck or Vanette under 10,000 lb",EC52596,NISSAN,ROGUE,UTILITY,JN8AS5MV3CW376358
3,4,39038,1,Passenger Car,EC52597,HONDA,CIVIC,Sedan,2HGES26754H602279
4,5,39039,1,"Pickup,Panel Truck or Vanette under 10,000 lb",EC52598,JEEP,COMPASS,UTILITY,1C4NJDBB7GD637883